/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_put_u.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: igbocha3 <igbocha3@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/02/17 23:50:58 by igbocha3          #+#    #+#             */
/*   Updated: 2022/04/26 00:36:48 by igbocha3         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// Десятичное число целого типа без знака

#include "libft.h"

int	ft_put_u(unsigned int u)
{
	long int	l;

	l = u;
	if (l >= 10)
		ft_put_u(l / 10);
	ft_put_c(l % 10 + 48);
	return (ft_len_d(u));
}
